//9. От конзолата се въвеждат три реални числа.Първото
//е ляв край на интервал, а второто десният му край.Да 
// се провери дали третото число се съдържа в интервала 
// и ако съвпада с единия му край да се изведе съобщение, 
// че интервалът е затворен.Ако числото е в интервала да се 
// изведе съобщение, че е в интервалът е отворен.Ако не се 
// намира в интервала да се изведе подходящо съобщение.
#include <iostream>

int main()
{
	double a, b, c;
	std::cin >> a >> b >> c;
	if (c < b && c > a)
		std::cout << "in the interval ";
	if (c == a || c == b)
		std::cout << "in the closed interval ";
	else
		std::cout << "not in the interval ";
}
