//10. Да се напише програма, в която се въвежда 4-цифренo естествено число n. 
// От това число се формират 2 нови 2-цифрени числа. Първото число се формира от 
// 1-вата и 4-тата цифра на n, а, второто - от 2-рaта и 3-тата цифра на n. На екрана 
// да се изведе дали 1-то ново число e по-малко, равно или по-голямо от 2-то число.

#include <iostream>

int main()
{
    int num;
    std::cin >> num;
    int x = num / 1000 * 10 + num % 10;
    std::cout << x;
    int y = num / 100 % 10 * 10 + num % 100 / 10;
    std::cout << y;
    std::cout << (x > y ? x : y);
}
