//12. Ще бъдат въведени две срещуположни точки за сформиране на 
// правоъгълник.(x, y координати) Приемаме, че той не е завъртян, 
//а е ориентиран успоредно на координатната система.При въвеждане 
// на още една точка установете дали тя се намира вътре, по контура 
// или отвън спрямо правоъгълника.
#include <iostream>

int main()
{
	int xa, ya, xb, yb, xc, yc;
	std::cin >> xa >> ya >> xb >> yb >> xc >> yc;
	if (xc > xa && xc < xb && yc > ya && yc < yb)
	{
		std::cout << "in";
	}
	else if ((xc < xa || xc > xb) && (yc < ya || yc > yb))
	{
		std::cout << "out";
	}
	else
		std::cout << "on the line";
}

