

//3. Да се прочетe от конзолата цяло число - година, и да се 
// изведе дали годината е високосна.
//година, деляща се на числото 4 без остатък, е високосна;
//ако годината обаче също се дели без остатък на 100, то тя не е високосна;
//но ако годината също се дели без остатък и на 400, то тя пак ще е високосна.
#include <iostream> 

int main()
{
    int year;
    std::cin >> year;
    if (year % 4 == 0 && year % 100 != 0)
    {
        std::cout << "leap year";
    }
    else if (year % 400 == 0)
        std::cout << "leap year";
    else
        std::cout << "not leap year";
}
